// Просто вставлю текст из документации

// Мы только что рассмотрели два способа объединения типов, которые похожи, но на самом деле немного отличаются. 
// С интерфейсами мы могли бы использовать предложение extends для расширения из других типов, 
// и мы смогли сделать нечто подобное с пересечениями и присвоить результату псевдоним типа. 
// Принципиальное различие между ними заключается в том, как обрабатываются конфликты, 
// и это различие обычно является одной из основных причин, 
// по которым вы предпочитаете одно другому между интерфейсом и псевдонимом типа типа пересечения.